{
  "banner": {
    "title": "Qualität, Präzision, Eleganz, Mein Wort.",
    "description": "Ich bin Agarv Caslu, ein Full-Stack-Entwickler. Ich mache jedes Projekt zu einer Erfolgsgeschichte.",
    "precision": "Präzision ist meine Obsession. Ich mache nichts einfach so, ich strebe immer nach dem Besten.",
    "button": "Meine Projekte"
  },
  "projectDetailsBtn": "Details",
  "projects": {
    "header": "Einige meiner Meisterwerke der",
    "headerStrong": "Ingenieurkunst",
    "project1": {
      "name": "Sofii",
      "description": "Echtzeit-Full-Stack-Soziales Netzwerk mit Express.js, Socket.IO, Vue.js und MySQL.",
      "techStack": [
        "devicon-nodejs-plain",
        "devicon-vuejs-plain",
        "devicon-mysql-plain",
        "devicon-socketio-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Echtzeit-Push-Benachrichtigungen",
        "Echtzeit-Likes, Kommentare",
        "Echtzeit-Chat-System",
        "Sichere Anmeldung mit JWT",
        "Erstellen & Verwalten von Posts",
        "Freunde, Anfragen, Follower",
        "Profilverwaltung",
        "Skalierbarkeit & Leistung",
        "Sauberes, modernes UI"
      ]
    },
    "project2": {
      "name": "Jagarv",
      "description": "Robustes Full-Stack-E-Commerce mit Java, Spring, Angular und PostgreSQL.",
      "techStack": [
        "devicon-java-plain",
        "devicon-spring-plain",
        "devicon-angularjs-plain",
        "devicon-postgresql-plain",
        "devicon-docker-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Warenkorb-System",
        "Sichere Zahlungen: Stripe, PayPal",
        "Admin-Panel-Verwaltung",
        "Admin-Dashboard mit Charts",
        "Review-System",
        "Rabatt- und Gutscheinsystem",
        "JWT-geschützte Anmeldung",
        "Bestellhistorie",
        "Vollständig responsives Design"
      ]
    },
    "project3": {
      "name": "Lebagarv",
      "description": "Full-Stack-Automarkt mit C#, ASP.NET 8, React und MySQL.",
      "techStack": [
        "devicon-csharp-plain",
        "devicon-dotnetcore-plain",
        "devicon-react-plain",
        "devicon-mysql-plain",
        "devicon-docker-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Anzeigen erstellen",
        "Anzeige-Suche System",
        "Echtzeit-Chat-System",
        "Favoriten-Anzeigen speichern",
        "Nutzerprofil-System",
        "Modernes & sauberes UI",
        "Hoch skalierbare Struktur",
        "Clean-Architecture-Muster"
      ]
    }
  },
  "test": "Hallo",
  "projectDetails": {
    "sofii": {
      "videoDetail": "Sofii Funktionsvideo",
      "videoDescription": "Leider konnte ich Sofii nicht auf einen Server hochladen. Ich habe jedoch ein Video vorbereitet, das die wichtigsten Funktionen der Anwendung in Aktion zeigt.",
      "homepageDetail": "Startseite",
      "homepageDescription": "In diesem Abschnitt wird ein Screenshot der Hauptseite der Anwendung angezeigt, auf der die meisten Echtzeit-Ereignisse stattfinden, wie Benachrichtigungen, der Echtzeit-Feed und Benutzerinteraktionen mit Beiträgen (z. B. Likes, gespeicherte Beiträge). Von dieser Seite aus kann der Benutzer mit Beiträgen interagieren, indem er sie liked, speichert oder auf Profile anderer Benutzer zugreift.",
      "chatDetail": "Chat-Seite",
      "chatPage": "In diesem Abschnitt wird die Chat-Seite angezeigt, auf der Benutzer in Echtzeit kommunizieren und den Aktivitätsstatus ihrer Kontakte (aktiv/inaktiv) einsehen können.",
      "profileDetails": "Profilseite",
      "profilePage": "Dies ist die Profilseite des Benutzers, von der aus Freundschaftsanfragen gesendet, andere Benutzer gefolgt, mit ihnen gechattet und relevante Informationen wie persönliche Daten und Beiträge eingesehen werden können.",
      "friendsDetail": "Freundes-Seite",
      "friendsPage": "Dies ist die Freundes-Seite, auf der der Benutzer seine Freundesliste einsehen, Freundschaftsanfragen verwalten und Einladungen annehmen oder ablehnen kann.",
      "notificationsDetails": "Benachrichtigungs-Seite",
      "notificationsPage": "Dies ist die Benachrichtigungs-Seite, auf der Benutzer ihre Benachrichtigungen einsehen und deren Löschung nach Belieben verwalten können.",
      "searchDetails": "Such-Seite",
      "searchPage": "Dies ist die Such-Seite, auf der Benutzer nach anderen Profilen oder Beiträgen suchen und Filter nach ihren Präferenzen anwenden können.",
      "savedsDetail": "Gespeicherte Beiträge-Seite",
      "savedsPage": "Dies ist die Seite der gespeicherten Beiträge, auf der Benutzer auf die von ihnen gespeicherten Beiträge zugreifen und mit ihnen interagieren können."
    },
    "jagarv": {
    "videoDetail": "Jagarv Funktionsvideo",
    "videoDescription": "Leider konnte ich Jagarv nicht auf einen Server hochladen. Allerdings habe ich ein Video vorbereitet, das die wichtigsten Funktionen der Anwendung in Aktion zeigt.",
    "homepageDetail": "Startseite",
    "homepage": "Dies ist die Hauptseite von Jagarv, auf der Benutzer aus verschiedenen Produktkategorien wählen oder andere Bereiche der Anwendung erkunden können.",
    "adminDashboardDetails": "Admin-Dashboard",
    "adminDashboard": "Dies ist das Verwaltungsdashboard, in dem der Administrator wichtige Informationen wie die heute registrierten Benutzer, die täglichen Einnahmen, die neuesten Bestellungen und den Gesamtumsatz des Unternehmens einsehen kann. Zudem gibt es eine interaktive Bestellgrafik.",
    "adminUsersDetails": "Benutzerverwaltung",
    "adminUsers": "Dies ist die Seite zur Benutzerverwaltung, auf der alle Benutzerdaten eingesehen und verwaltet werden können, einschließlich der Möglichkeit, Konten zu sperren oder zu entsperren.",
    "adminPostsDetails": "Produktverwaltung",
    "adminPosts": "Dies ist die Seite zur Produktverwaltung, auf der alle in der Anwendung verfügbaren Artikel angezeigt werden. Zusätzlich können Produkte bearbeitet, gelöscht, angesehen oder hervorgehoben werden.",
    "adminOrdersDetails": "Bestellverwaltung",
    "adminOrders": "Dies ist die Seite zur Bestellverwaltung, auf der alle in der Anwendung getätigten Bestellungen verwaltet werden. Bestellstatus können aktualisiert werden, um Benutzer über den Fortschritt zu informieren, z. B. mit Status wie 'In Bearbeitung', 'Geliefert' oder 'In Vorbereitung'.",
    "cartPageDetails": "Einkaufswagen",
    "cartPage": "Dies ist die Einkaufswagen-Seite, auf der Benutzer ihre Produkte verwalten, Artikel entfernen, ihren Einkauf mit oder ohne Rabattgutschein abschließen und ihre Zahlungsmethode (PayPal oder Stripe) wählen können.",
    "wishlistPageDetails": "Wunschliste",
    "wishlistPage": "Dies ist die Wunschliste-Seite, auf der Benutzer die Produkte verwalten können, die sie kaufen möchten.",
    "searchPageDetails": "Suchseite",
    "searchPage": "Dies ist die Suchseite, auf der Benutzer die Produkte der Anwendung durchsuchen und Filter anwenden können, um ihre Suche zu verfeinern."
},

    "lebagarv": {
        "videoDetail": "Lebagarv Funktionsvideo",
        "videoDescription": "Leider konnte ich Lebagarv nicht auf einen Server hochladen. Ich habe jedoch ein Video vorbereitet, das die wichtigsten Funktionen der Anwendung in Aktion zeigt.",
        "homepageDetail": "Startseite",
        "homepage": "Dies ist die Startseite, auf der der Benutzer eine Vielzahl von Fahrzeuganzeigen verschiedener fiktiver Marken durchsuchen kann. Darüber hinaus hat der Benutzer die Möglichkeit, durch die verschiedenen Abschnitte der Anwendung zu navigieren.",
        "carPageDetail": "Fahrzeuganzeigen-Seite",
        "carPage": "Dies ist die Detailseite der Fahrzeuganzeige, auf der der Benutzer Bilder des Fahrzeugs anzeigen und auf wichtige Informationen wie Kilometerstand, Farbe und technische Spezifikationen zugreifen kann. Darüber hinaus besteht die Möglichkeit, den Verkäufer über den integrierten Chat zu kontaktieren.",
        "chatsPageDetail": "Chats-Seite",
        "chatsPage": "Dies ist die Seite für Chats, auf der alle Gespräche des Benutzers innerhalb der Anwendung angezeigt werden. Wenn der Benutzer einen Chat auswählt, wird er zur Chat-Seite weitergeleitet, auf der er Nachrichten in Echtzeit senden und empfangen kann.",
        "chatPageDetail": "Chat-Seite",
        "chatPage": "Dies ist die Chat-Seite, auf der der Benutzer Nachrichten in Echtzeit anzeigen, senden und empfangen kann, mit Unterstützung für multimediale Inhalte wie Bilder, Audios und Videos. Ein idealer Raum, um Details wie den Preis des Fahrzeugs direkt mit dem Verkäufer zu verhandeln.",
        "favoritesPageDetail": "Favoriten-Seite",
        "favoritesPage": "Dies ist die Seite für Favoriten, auf der der Benutzer auf die Liste der Fahrzeuge zugreifen und diese verwalten kann, die er als Favoriten markiert hat, um sie später zu überprüfen.",
        "profilePageDetails": "Profil-Seite",
        "profilePage": "Dies ist die Profil-Seite, auf der der Benutzer seine Fahrzeuge oder die anderer sehen kann. Wenn der Benutzer auf sein eigenes Profil zugreift, hat er die Möglichkeit, sein Profilbild und Banner zu aktualisieren.",
        "searchPageDetails": "Such-Seite",
        "searchPage": "Dies ist die Such-Seite, auf der der Benutzer Fahrzeuge nach Titel, Modell oder Marke suchen kann, um schnell das zu finden, wonach er sucht."
    }


  }, 
  
  "contactForm": {
    "contactFormHeader": "Gib mir ein Zeichen",
    "nameLabel": "Ihr Name",
    "emailLabel": "Ihre E-Mail",
    "messageLabel": "Ihre Nachricht",
    "loadingMessage": "Einen Moment...",
    "errorMessage": "Hoppla! Ein Fehler ist aufgetreten...",
    "successMessage": "E-Mail Gesendet.",
    "sendMessage": "Senden",
    "nameError": "Muss mindestens 3 Zeichen enthalten",
    "emailError": "Geben Sie eine gültige E-Mail ein.",
    "messageError": "Muss mindestens 10 Zeichen enthalten",
    "nameMinLengthError": "Muss mindestens 3 Zeichen enthalten",
    "emailInvalidError": "Geben Sie eine gültige E-Mail ein.",
    "messageMinLengthError": "Muss mindestens 10 Zeichen enthalten"
  }

}