{
  "banner": {
    "title": "Quality, Precision, Elegance, My Word.",
    "description": "I am Agarv Caslu, a Full-Stack developer. I turn every project into a success story.",
    "precision": "Precision is my obsession. I don’t do things just to do them, I always strive for the best.",
    "button": "My Projects"
  },
  "projectDetailsBtn": "details",
  "projects": {
    "header": "Some of My Masterpieces of",
    "headerStrong": "Engineering",
    "project1": {
      "name": "Sofii",
      "description": "Real-time Full-Stack social network built with Express.js, Socket.IO, Vue.js, and MySQL.",
      "techStack": [
        "devicon-nodejs-plain",
        "devicon-vuejs-plain",
        "devicon-mysql-plain",
        "devicon-socketio-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Real-time push notifications",
        "Real-time likes, comments",
        "Real-time messaging system",
        "Secure authentication with JWT",
        "Create and manage posts",
        "Friends, requests, followers",
        "Profile management",
        "Scalability & performance",
        "Clean, modern, responsive UI"
      ]
    },
    "project2": {
      "name": "Jagarv",
      "description": "Robust Full-Stack E-Commerce built with Java, Spring, Angular, and PostgreSQL.",
      "techStack": [
        "devicon-java-plain",
        "devicon-spring-plain",
        "devicon-angularjs-plain",
        "devicon-postgresql-plain",
        "devicon-docker-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Shopping cart system",
        "Secure payments: Stripe, PayPal",
        "Admin panel management",
        "Admin dashboard with charts",
        "Review system",
        "Discount system",
        "JWT-secured login system",
        "Order history tracking",
        "Responsive design"
      ]
    },
    "project3": {
      "name": "Lebagarv",
      "description": "Full-Stack car marketplace built with C#, ASP.NET 8, React, and MySQL.",
      "techStack": [
        "devicon-csharp-plain",
        "devicon-dotnetcore-plain",
        "devicon-react-plain",
        "devicon-mysql-plain",
        "devicon-docker-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Ad posting",
        "Ad search",
        "Real-time chat system",
        "Favorite ads management",
        "User profile system",
        "Modern & clean UI design",
        "Highly scalable structure",
        "Clean Architecture pattern"
      ]
    }
  },
  "test": "Hello",
  "projectDetails": {
    "sofii": {
      "videoDetail": "Sofii Functioning Video",
      "videoDescription": "Unfortunately, I have been unable to upload Sofii to a server. However, I have prepared a video that showcases the most important features of the application in action.",
      "homepageDetail": "Homepage",
      "homepageDescription": "This section presents a screenshot of the application's main page, where most real-time events take place, such as notifications, the real-time feed, and user interactions with posts (e.g., likes, saved posts). From this page, users can engage with posts through likes, save them, or visit other users' profiles.",
      "chatDetail": "Chat Page",
      "chatPage": "This section displays the chat page, where users can communicate in real-time and view the activity status of their contacts (active/inactive).",
      "profileDetails": "Profile Page",
      "profilePage": "This is the user's profile page, where they can send friend requests, follow other users, chat with them, and view relevant information such as personal details and posts.",
      "friendsDetail": "Friends Page",
      "friendsPage": "This is the friends page, where users can review their friends list, manage friend requests, and accept or reject invitations.",
      "notificationsDetails": "Notifications Page",
      "notificationsPage": "This is the notifications page, where users can check their notifications and manage their deletion as they see fit.",
      "searchDetails": "Search Page",
      "searchPage": "This is the search page, where users can explore other profiles or posts and apply filters according to their preferences.",
      "savedsDetail": "Saved Posts Page",
      "savedsPage": "This is the saved posts page, where users can access the posts they have saved and interact with them."
    },
    "jagarv": {
    "videoDetail": "Jagarv Functionality Video",
    "videoDescription": "Unfortunately, I have not been able to upload Jagarv to a server. However, I have prepared a video showcasing the application's key functionalities in action.",
    "homepageDetail": "Homepage",
    "homepage": "This is the main page of Jagarv, where users can select from various product categories or explore other sections of the application.",
    "adminDashboardDetails": "Admin Dashboard",
    "adminDashboard": "This is the administration panel, where the administrator can access key information such as today's registered users, daily earnings, recent orders, and the company's total revenue. Additionally, an interactive order graph is included.",
    "adminUsersDetails": "User Management",
    "adminUsers": "This is the user management page, where all user data can be viewed and managed, including options to ban or unban accounts.",
    "adminPostsDetails": "Product Management",
    "adminPosts": "This is the product management page, where all available items in the application are displayed. Additionally, users can edit, delete, view, or feature products.",
    "adminOrdersDetails": "Order Management",
    "adminOrders": "This is the order management page, where all orders placed in the application can be managed. Order statuses can be updated to keep users informed, with statuses such as 'In Process,' 'Delivered,' or 'Preparing'.",
    "cartPageDetails": "Shopping Cart",
    "cartPage": "This is the shopping cart page, where users can manage their selected products, remove items, complete their purchase with or without a discount coupon, and choose their payment method, either PayPal or Stripe.",
    "wishlistPageDetails": "Wishlist",
    "wishlistPage": "This is the wishlist page, where users can manage the products they wish to purchase.",
    "searchPageDetails": "Search Page",
    "searchPage": "This is the search page, where users can browse through the application's products and apply filters to refine their search."
},

    "lebagarv": {
        "videoDetail": "Lebagarv Functioning Video",
        "videoDescription": "Unfortunately, I have not been able to upload Lebagarv to a server. However, I have prepared a video that showcases the key functionalities of the application in action.",
        "homepageDetail": "Homepage",
        "homepage": "This is the homepage, where the user can explore a variety of car listings from various fictitious brands. Additionally, the user has the option to navigate through different sections of the application.",
        "carPageDetail": "Car Listing Page",
        "carPage": "This is the car listing details page, where the user can view images of the car and access key information such as mileage, color, and technical specifications. Additionally, there is the option to contact the seller through the integrated chat.",
        "chatsPageDetail": "Chats Page",
        "chatsPage": "This is the chats page, where all the user's conversations within the application are displayed. By selecting a chat, the user will be redirected to the chat page, where they can send and receive messages in real-time.",
        "chatPageDetail": "Chat Page",
        "chatPage": "This is the chat page, where the user can view, send, and receive messages in real-time, with support for multimedia content such as images, audio, and videos. An ideal space to negotiate details such as the price of the vehicle directly with the seller.",
        "favoritesPageDetail": "Favorites Page",
        "favoritesPage": "This is the favorites page, where the user can access and manage the list of cars they have marked as favorites for later review.",
        "profilePageDetails": "Profile Page",
        "profilePage": "This is the profile page, where the user can view their vehicles or those of others. If accessing their own profile, the user will have the option to update their profile picture and account banner.",
        "searchPageDetails": "Search Page",
        "searchPage": "This is the search page, where the user can search for cars based on title, model, or brand to quickly find what they are looking for."
    }



  },
  "contactForm": {
      "contactFormHeader": "Get In Touch",
      "nameLabel": "Your Name",
      "emailLabel": "Your Email",
      "messageLabel": "Your Message",
      "loadingMessage": "One Moment...",
      "errorMessage": "Oops! An Error Occurred...",
      "successMessage": "Email Sent.",
      "sendMessage": "Send",
      "nameError": "Must be at least 3 characters",
      "emailError": "Enter a valid email.",
      "messageError": "Must contain at least 10 characters"
}
}