{
  "banner": {
    "title": "Calidad, Precisión, Elegancia, Mi Palabra.",
    "description": "Soy Agarv Caslu, desarrollador Full-Stack. Transformo cada proyecto en una historia de éxito.",
    "precision": "La precisión es mi obsesión. No hago las cosas solo por hacerlas, siempre busco lo mejor.",
    "button": "Mis Proyectos"
  },
  "projectDetailsBtn": "detalles",
  "projects": {
    "header": "Algunas de mis Obras Maestras de la",
    "headerStrong": "Ingeniería",
    "project1": {
      "name": "Sofii",
      "description": "Red social Full-Stack en tiempo real Hecha con Express.js, Socket.IO, Vue.js y MySQL.",
      "techStack": [
        "devicon-nodejs-plain",
        "devicon-vuejs-plain",
        "devicon-mysql-plain",
        "devicon-socketio-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Notificaciones push tiempo real",
        "Likes, comentarios en tiempo real",
        "Chats en tiempo real",
        "Autenticación segura con JWT",
        "Creación de publicaciones",
        "amigos, solicitudes y seguidores",
        "Gestión de perfiles",
        "escalabilidad y rendimiento",
        "Interfaz limpia, moderna y responsiva"
      ]
    },
    "project2": {
      "name": "Jagarv",
      "description": "E-Commerce Robusto Full-Stack Hecho con Java, Spring, Angular y PostgreSQL.",
      "techStack": [
        "devicon-java-plain",
        "devicon-spring-plain",
        "devicon-angularjs-plain",
        "devicon-postgresql-plain",
        "devicon-docker-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Carrito de compras",
        "pagos seguros con Stripe y PayPal",
        "Panel de administración",
        "Admin Dashboard con Graficos",
        "Sistema de reseñas",
        "Sistema de descuentos",
        "Autenticación con JWT",
        "Historial de pedidos",
        "Responsive Design"
      ]
    },
    "project3": {
      "name": "Lebagarv",
      "description": "Marketplace de coches Full-Stack hecho en C#, ASP.NET 8, React y MySQL.",
      "techStack": [
        "devicon-csharp-plain",
        "devicon-dotnetcore-plain",
        "devicon-react-plain",
        "devicon-mysql-plain",
        "devicon-docker-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Publicación de anuncios",
        "Busqueda de anuncios",
        "Chat en tiempo real",
        "Gestión de anuncios favoritos",
        "Gestion de Perfil",
        "UI Moderna y Limpia",
         "Codigo escalable",
        "Patron Clean Architecture"
      ]
    }
  },
  "test": "Hola",
  "projectDetails": {
    "sofii": {
      "videoDetail": "Video De Sofii Funcionando",
      "videoDescription": "Desafortunadamente, no he podido subir Sofii a un servidor. Sin embargo, he preparado un video en el que se muestran las funcionalidades más importantes de la aplicación en acción.",
      "homepageDetail": "Página Príncipal",
      "homepageDescription": "En esta seccion, se presenta una captura de pantalla de la página principal de la aplicación, donde suceden la mayoria de eventos en Tiempo real como Las Notificaciones, El Feed En tiempo real, y las interacciones de los usuarios con las publicaciones. Ej: Likes, Saved. Desde esta página, el usuario puede interactuar con las publicaciones mediante likes, guardarlas, o acceder al perfil de otros usuarios.",
      "chatDetail": "Página de Chat",
      "chatPage": "En esta sección, se muestra la página de chat, donde los usuarios pueden comunicarse en tiempo real y visualizar el estado de actividad de sus contactos (activo/inactivo).",
      "profileDetails": "Página de Perfil",
      "profilePage": "Esta es la página de perfil del usuario, desde donde se pueden enviar solicitudes de amistad, seguir a otros usuarios, chatear con otros usuarios, y consultar información relevante, como datos personales y publicaciones.",
      "friendsDetail": "Página de Amigos", 
      "friendsPage": "Esta es la página de amigos, donde el usuario puede consultar su lista de amigos, gestionar las solicitudes de amistad y aceptar o rechazar invitaciones.",
      "notificationsDetails": "Página de Notificaciones",
      "notificationsPage": "Esta es la página de notificaciones, donde los usuarios pueden consultar sus notificaciones y gestionar su eliminación según lo deseen.", 
      "searchDetails": "Página de Busqueda",
      "searchPage": "Esta es la página de búsqueda, donde los usuarios pueden explorar otros perfiles o publicaciones, y aplicar filtros según sus preferencias.",
      "savedsDetail": "Página de Guardados",
      "savedsPage": "Esta es la página de publicaciones guardadas, donde los usuarios pueden acceder a las publicaciones que han guardado y interactuar con ellas."
    },
    "jagarv": {
        "videoDetail": "Video de Jagarv Funcionando",
        "videoDescription": "Desafortunadamente, no he podido subir Jagarv a un servidor. Sin embargo, he preparado un video en el que se muestran las funcionalidades más importantes de la aplicación en acción.",
        "homepageDetail": "Pagina Principal",
        "homepage": "Esta es la página principal de Jagarv, donde el usuario puede seleccionar entre diversas categorías de productos o explorar otras secciones de la aplicación",
        "adminDashboardDetails": "Panel De Administracion",
        "adminDashboard": "Este es el panel de administración, donde el administrador puede consultar información clave como los usuarios registrados hoy, las ganancias diarias, los pedidos recientes y las ganancias totales de la empresa. Además, se incluye un gráfico interactivo de los pedidos.",
        "adminUsersDetails": "Administracion de Usuarios",
        "adminUsers": "Esta es la página de administración de usuarios, donde se pueden visualizar todos los datos de los usuarios de la aplicación y gestionar su estado, incluyendo opciones para banear o desbloquear cuentas.",
        "adminPostsDetails": "Administracion De Productos",
        "adminPosts": "Esta es la página de administración de productos, donde se muestran todos los artículos disponibles en la aplicación. Además, se ofrecen opciones para editarlos, eliminarlos, visualizarlos o destacarlos.",
        "adminOrdersDetails": "Administracion De Pedidos",
        "adminOrders": "Esta es la página de administración de pedidos, donde se gestionan los pedidos realizados en la aplicación. Se puede actualizar el estado de los pedidos para mantener informados a los usuarios, por ejemplo, con estados como 'En trámite', 'Ha llegado' o 'Preparando'.",
        "cartPageDetails": "Carrito De Compras",
        "cartPage": "Esta es la página del carrito de compras, donde el usuario puede gestionar los productos, eliminar artículos, finalizar la compra utilizando o no un cupón de descuento y elegir su método de pago, ya sea PayPal o Stripe.",
        "wishlistPageDetails": "Lista De Deseos",
        "wishlistPage": "Esta es la página de la lista de deseos del usuario, donde puede gestionar los productos que desea adquirir.",
        "searchPageDetails": "Pagina De Busqueda",
        "searchPage": "Esta es la página de búsqueda, donde el usuario puede explorar los productos de la aplicación y aplicar filtros para refinar su búsqueda."
    },
    "lebagarv": {
        "videoDetail": "Video de Lebagarv Funcionando",
        "videoDescription": "Desafortunadamente, no he podido subir Lebagarv a un servidor. Sin embargo, he preparado un video en el que se muestran las funcionalidades más importantes de la aplicación en acción.",
        "homepageDetail": "Pagina Principal",
        "homepage": "Esta es la página principal, donde el usuario puede explorar una variedad de anuncios de coches de diversas marcas ficticias. Además, cuenta con la posibilidad de navegar por las distintas secciones de la aplicación.",
        "carPageDetail": "Pagina De Anuncio",
        "carPage": "Esta es la página de detalles del anuncio, donde el usuario puede visualizar imágenes del coche y acceder a información clave, como kilometraje, color y especificaciones técnicas. Además, se ofrece la opción de contactar al vendedor a través del chat integrado",
        "chatsPageDetail": "Pagina de Chats",
        "chatsPage": "Esta es la página de chats, donde se muestran todas las conversaciones del usuario dentro de la aplicación. Al seleccionar un chat, el usuario será redirigido a la pagina de chat, donde podrá enviar y recibir mensajes en tiempo real.",
        "chatPageDetail": "Pagina de Chat",
        "chatPage": "Esta es la página de chat, donde el usuario puede visualizar, enviar y recibir mensajes en tiempo real, con soporte para contenido multimedia, como imágenes, audios y videos. un espacio ideal para negociar detalles como el precio del vehículo directamente con el vendedor."
        "favoritesPageDetail": "Pagina de Favoritos",
        "favoritesPage": "Esta es la página de coches favoritos, donde el usuario puede acceder y gestionar la lista de coches que ha marcado como favoritos para revisarlos posteriormente.",
        "profilePageDetails": "Pagina de Perfil",
        "profilePage": "Esta es la página de perfil, donde el usuario puede visualizar sus vehículos o los de otros. Si está accediendo a su propio perfil, tendrá la opción de actualizar su foto de perfil y el banner de su cuenta.",
        "searchPageDetails": "Pagina de Busqueda",
        "searchPage": "Esta es la página de búsqueda, donde el usuario puede buscar los coches según el título, modelo o marca para encontrar rápidamente lo que está buscando."
    }
  }
}