{
  "banner": {
    "title": "Qualité, Précision, Élégance, Ma Parole.",
    "description": "Je suis Agarv Caslu, développeur Full-Stack. Je transforme chaque projet en une réussite.",
    "precision": "La précision est mon obsession. Je ne fais rien au hasard, je vise toujours l'excellence.",
    "button": "Mes Projets"
  },
  "projectDetailsBtn": "Détails",
  "projects": {
    "header": "Quelques-unes de mes Œuvres Maîtresses en",
    "headerStrong": "Ingénierie",
    "project1": {
      "name": "Sofii",
      "description": "Réseau social Full-Stack en temps réel avec Express.js, Socket.IO, Vue.js et MySQL.",
      "techStack": [
        "devicon-nodejs-plain",
        "devicon-vuejs-plain",
        "devicon-mysql-plain",
        "devicon-socketio-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Notifications push en temps réel",
        "Likes et commentaires en temps réel",
        "chat en temps réel",
        "Authentification sécurisée JWT",
        "Création et gestion de posts",
        "Amis, demandes, abonnements",
        "Gestion des profils utilisateurs",
        "Scalabilité et performance",
        "Interface propre et moderne"
      ]
    },
    "project2": {
      "name": "Jagarv",
      "description": "E-Commerce Full-Stack robuste avec Java, Spring, Angular et PostgreSQL.",
      "techStack": [
        "devicon-java-plain",
        "devicon-spring-plain",
        "devicon-angularjs-plain",
        "devicon-postgresql-plain",
        "devicon-docker-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Système de panier",
        "Paiements sécurisés : Stripe, PayPal",
        "Tableau de bord administrateur",
        "Admin Dashboard avec Graphiques",
        "Système de notes",
        "Gestion des promotions",
        "Connexion sécurisée via JWT",
        "Historique des commandes",
        "Design entièrement responsive"
      ]
    },
    "project3": {
      "name": "Lebagarv",
      "description": "Marketplace automobile Full-Stack avec C#, ASP.NET 8, React et MySQL.",
      "techStack": [
        "devicon-csharp-plain",
        "devicon-dotnetcore-plain",
        "devicon-react-plain",
        "devicon-mysql-plain",
        "devicon-docker-plain",
        "devicon-typescript-plain"
      ],
      "functionalities": [
        "Publication d'annonces",
        "Recherche d'annonces",
        "Chat en temps réel",
        "Gestion des annonces favorites",
        "Gestion de profil utilisateur",
        "UI moderne et épurée",
        "Architecture hautement scalable",
        "Modèle Clean Architecture"
      ]
    }
  },
  "projectDetails": {
    "sofii": {
      "videoDetail": "Vidéo de Fonctionnement de Sofii",
      "videoDescription": "Malheureusement, je n'ai pas pu publier Sofii sur un serveur. Cependant, j'ai préparé une vidéo qui montre les fonctionnalités les plus importantes de l'application en action.",
      "homepageDetail": "Page d'Accueil",
      "homepageDescription": "Cette section présente une capture d'écran de la page principale de l'application, où se déroulent la plupart des événements en temps réel, tels que les notifications, le fil d'publications en temps réel et les interactions des utilisateurs avec les publications (par exemple, les likes, les publications enregistrées). Depuis cette page, l'utilisateur peut interagir avec les publications en aimant, en les enregistrant ou en accédant aux profils d'autres utilisateurs.",
      "chatDetail": "Page de Chat",
      "chatPage": "Cette section montre la page de chat, où les utilisateurs peuvent communiquer en temps réel et voir l'état d'activité de leurs contacts (actif/inactif).",
      "profileDetails": "Page de Profil",
      "profilePage": "Voici la page de profil de l'utilisateur, à partir de laquelle il peut envoyer des demandes d'amis, suivre d'autres utilisateurs, discuter avec eux et consulter des informations pertinentes, telles que des données personnelles et des publications.",
      "friendsDetail": "Page d'Amis",
      "friendsPage": "Voici la page des amis, où l'utilisateur peut consulter sa liste d'amis, gérer les demandes d'amis et accepter ou rejeter des invitations.",
      "notificationsDetails": "Page de Notifications",
      "notificationsPage": "Voici la page des notifications, où les utilisateurs peuvent consulter leurs notifications et gérer leur suppression selon leurs préférences.",
      "searchDetails": "Page de Recherche",
      "searchPage": "Voici la page de recherche, où les utilisateurs peuvent explorer d'autres profils ou publications et appliquer des filtres en fonction de leurs préférences.",
      "savedsDetail": "Page des Publications Enregistrées",
      "savedsPage": "Voici la page des publications enregistrées, où les utilisateurs peuvent accéder aux publications qu'ils ont enregistrées et interagir avec elles."
    },
    "jagarv": {
    "videoDetail": "Vidéo de Fonctionnement de Jagarv",
    "videoDescription": "Malheureusement, je n’ai pas pu héberger Jagarv sur un serveur. Cependant, j’ai préparé une vidéo présentant les principales fonctionnalités de l’application en action.",
    "homepageDetail": "Page d’Accueil",
    "homepage": "Ceci est la page principale de Jagarv, où l’utilisateur peut choisir parmi différentes catégories de produits ou explorer d’autres sections de l’application.",
    "adminDashboardDetails": "Tableau de Bord Administratif",
    "adminDashboard": "Ceci est le tableau de bord d'administration, où l’administrateur peut consulter des informations essentielles telles que les utilisateurs enregistrés aujourd’hui, les revenus quotidiens, les commandes récentes et le chiffre d’affaires total de l’entreprise. Un graphique interactif des commandes est également inclus.",
    "adminUsersDetails": "Gestion des Utilisateurs",
    "adminUsers": "Ceci est la page de gestion des utilisateurs, où toutes les données des utilisateurs peuvent être consultées et gérées, y compris les options pour bannir ou débannir des comptes.",
    "adminPostsDetails": "Gestion des Produits",
    "adminPosts": "Ceci est la page de gestion des produits, où tous les articles disponibles dans l’application sont affichés. Il est également possible de les modifier, supprimer, visualiser ou mettre en avant.",
    "adminOrdersDetails": "Gestion des Commandes",
    "adminOrders": "Ceci est la page de gestion des commandes, où toutes les commandes passées dans l’application peuvent être administrées. Il est possible de mettre à jour le statut des commandes afin d’informer les utilisateurs, avec des statuts tels que 'En cours de traitement', 'Livré' ou 'En préparation'.",
    "cartPageDetails": "Panier d’Achat",
    "cartPage": "Ceci est la page du panier, où l’utilisateur peut gérer ses produits, supprimer des articles, finaliser son achat avec ou sans un coupon de réduction, et choisir son mode de paiement, PayPal ou Stripe.",
    "wishlistPageDetails": "Liste de Souhaits",
    "wishlistPage": "Ceci est la page de la liste de souhaits, où l’utilisateur peut gérer les produits qu’il souhaite acheter.",
    "searchPageDetails": "Page de Recherche",
    "searchPage": "Ceci est la page de recherche, où l’utilisateur peut parcourir les produits de l’application et appliquer des filtres pour affiner sa recherche."
},
    "lebagarv": {
        "videoDetail": "Vidéo de fonctionnement de Lebagarv",
        "videoDescription": "Malheureusement, je n'ai pas pu télécharger Lebagarv sur un serveur. Cependant, j'ai préparé une vidéo qui présente les fonctionnalités clés de l'application en action.",
        "homepageDetail": "Page d'accueil",
        "homepage": "C'est la page d'accueil, où l'utilisateur peut explorer une variété d'annonces de voitures de différentes marques fictives. De plus, l'utilisateur a la possibilité de naviguer dans les différentes sections de l'application.",
        "carPageDetail": "Page de l'annonce de voiture",
        "carPage": "C'est la page des détails de l'annonce, où l'utilisateur peut voir des images de la voiture et accéder à des informations clés telles que le kilométrage, la couleur et les spécifications techniques. De plus, il existe la possibilité de contacter le vendeur via le chat intégré.",
        "chatsPageDetail": "Page des Chats",
        "chatsPage": "C'est la page des chats, où toutes les conversations de l'utilisateur au sein de l'application sont affichées. En sélectionnant un chat, l'utilisateur sera redirigé vers la page de chat, où il pourra envoyer et recevoir des messages en temps réel.",
        "chatPageDetail": "Page de Chat",
        "chatPage": "C'est la page de chat, où l'utilisateur peut voir, envoyer et recevoir des messages en temps réel, avec prise en charge de contenus multimédia tels que des images, des audios et des vidéos. Un espace idéal pour négocier des détails comme le prix du véhicule directement avec le vendeur.",
        "favoritesPageDetail": "Page des Favoris",
        "favoritesPage": "C'est la page des favoris, où l'utilisateur peut accéder et gérer la liste des voitures qu'il a marquées comme favorites pour une révision ultérieure.",
        "profilePageDetails": "Page de Profil",
        "profilePage": "C'est la page de profil, où l'utilisateur peut voir ses véhicules ou ceux des autres. S'il accède à son propre profil, l'utilisateur aura la possibilité de mettre à jour sa photo de profil et sa bannière de compte.",
        "searchPageDetails": "Page de Recherche",
        "searchPage": "C'est la page de recherche, où l'utilisateur peut rechercher des voitures en fonction du titre, du modèle ou de la marque pour trouver rapidement ce qu'il recherche."
    }
  },
  "test": "Bonjour",
  "contactForm": {
      "contactFormHeader": "Donne-moi un Coup de Fil",
      "nameLabel": "Votre Nom",
      "emailLabel": "Votre Email",
      "messageLabel": "Votre Message",
      "loadingMessage": "Un Instant...",
      "errorMessage": "Oups ! Une Erreur s'est Produite...",
      "successMessage": "Email Envoyé.",
      "sendMessage": "Envoyer",
      "nameError": "Doit contenir au moins 3 caractères",
      "emailError": "Entrez un email valide.",
      "messageError": "Doit contenir au moins 10 caractères"
}
}